using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace WebHelper.ServiceLayer
{
    public static class PolicyService
    {
        #region Policy
        public static string lbHeader = @"นโยบายความเป็นส่วนตัว";

        public static string lbHeader2 =
            @"ธนาคารตระหนักถึงความปลอดภัยของข้อมูลส่วน ตัวของลูกค้าที่ใช้ผลิตภัณฑ์และบริการต่างๆ ของธนาคารเป็นสำคัญ ดังนั้น ธนาคารจึงมีนโยบายและแนวทางปฏิบัติ ความเคารพ รักษาความปลอดภัย ปกป้องและรักษาข้อมูลส่วนตัวของลูกค้า เพื่อเป็นการสร้างความเชื่อมั่นและมั่นใจให้กับลูกค้าธนาคารซีไอเอ็มบีไทย";

        public static string lbContent1 = @"1. ความมุ่งมั่นของธนาคารที่มีต่อความเป็นส่วนตัวของท่าน";

        public static string lbContent1Detail1 =
            @"ธนาคารพิจารณาลูกค้าและความสนใจของลูกค้าเป็น อันดับแรกเสมอในการนำเสนอผลิตภัณฑ์และบริการแก่ลูกค้าของธนาคาร ด้วยเหตุนี้ " +
            @"ธนาคารจึงมุ่งมั่นเพื่อให้มั่นใจได้ว่าความเป็นส่วนตัวในเรื่องส่วนบุคคลของท่าน ข้อมูลทางการธนาคารและการเงิน รวมถึงข้อมูลอื่นๆ ที่เกี่ยวข้อง หรือเกี่ยวโยงกับข้อมูล (“ข้อมูล”) " +
            @"ที่มีการเปิดเผย แบ่งปัน แลกเปลี่ยน หรือ แจ้งกับธนาคารด้วยวิธีการอื่นๆ ธนาคารจะให้ความเคารพ รักษาความปลอดภัย ปกป้องและรักษาข้อมูลของลูกค้า  ตลอดเวลา";

        public static string lbContent1Detail2 =
            @"เพื่อประโยชน์ของท่านนโยบายความเป็นส่วนตัวนี้ (ซึ่งธนาคารอาจทำการแก้ไขเป็นครั้งคราว) ได้ถูกจัดทำขึ้นเพื่ออธิบายรายละเอียดนโยบายและหลักการของธนาคาร เกี่ยวกับความเป็นส่วนตัวของท่าน ซึ่งทั้งหมดนี้" +
            @"ได้แสดงถึงความมุ่งมั่นของธนาคารในการเคารพ รักษาความปลอดภัย  ปกป้องและรักษาข้อมูลความเป็นส่วนตัวของท่าน";

        public static string lbContent1Detail3 =
            @"นโยบายนี้ จะนำไปใช้กับลูกค้า ผู้เยี่ยมชม และ ผู้ใช้บริการเว็บไซต์ของ ธนาคารซีไอเอ็มบี" +
            @"และ ช่องทางอิเล็คทรอนิคส์อื่นๆทั้งหมด โดยคำว่า “ธนาคาร” และ “ซีไอเอ็มบี” จะหมายถึงบริษัทใดๆที่อยู่ภายในธนาคารซีไอเอ็มบีไทย จำกัด (มหาชน) (CIMB Thai) ที่เป็นผู้นำเสนอผลิตภัณฑ์และบริการต่างๆ ด้วย";

        public static string lbContent1Detail4 =
            @"เว็บไซต์นี้ อาจมีข้อมูลอ้างอิงหรือไฮเปอร์ลิงค์ ที่เชื่อมต่อไปยังเว็บไซต์อื่นๆ ที่ธนาคารมิได้เป็นผู้ดำเนินการ ธนาคารจะไม่รับผิดชอบต่อเนื้อหา หรือวิธีปฏิบัติที่เกี่ยวข้องกับความเป็นส่วนตัวใดๆของเว็บไซต์ดังกล่าว" +
            @"ในกรณีที่ท่านเลือกใช้แถบลิงค์ที่อยู่ในเว็บไซต์นี้เพื่อเป็นการเยี่ยมชม เว็บไซต์อื่นๆ ธนาคารขอแนะนำให้ท่านอ่านนโยบายความเป็นส่วนตัวที่ประกาศไว้บนเว็บไซต์นั้นๆ ด้วย";

        public static string lbContent2 = @"2. ประเภทข้อมูลที่ธนาคารเลือก";

        public static string lbContent2Detail1 =
            @"ประเภทของข้อมูลที่ธนาคารได้รวบรวมจากการเข้า ถึงและการใช้ผลิตภัณฑ์และบริการต่างๆ ซึ่งมีวิธีการเก็บข้อมูลแตกต่างกันไป " +
            @"ซึ่งข้อมูลที่ธนาคารได้รวบรวมโดยทั่วไปจะประกอบด้วยข้อมูลสารสนเทศที่เกี่ยว ข้องกับท่าน เช่น ชื่อ ที่อยู่ อีเมล์ (หรือข้อมูลการติดต่ออื่นๆ) " +
            @"อายุ เพศ เชื้อชาติ หมายเลขบัตรประชาชน รวมถึงข้อมูลทางการเงินการธนาคาร อาทิเช่น ยอดธุรกรรมคงเหลือ ทรัพย์สิน ภาระหนี้สิน รายได้ และความน่าเชื่อถือทางเครดิต " +
            @"และในกรณีที่ลูกค้าเป็นบริษัท จะมีข้อมูลเกี่ยวกับทรัพย์สิน ภาระหนี้สิน กรรมการ พนักงาน ผู้ถือหุ้น และการค้าขายเชิงการเงินและพาณิชย์ นอกจากนี้ ธนาคารอาจขอข้อมูลอื่นๆที่เกี่ยวข้องกับท่านเพิ่มเติมเพื่อนำเสนอผลิตภัณฑ์ และบริการใหม่ๆ ให้ตรงตามความต้องการของท่าน";

        public static string lbContent2Detail2 =
            @"ท่านต้องตระหนักถึง รหัสผู้ใช้บริการ (User ID) ,อีเมล์ ที่ท่านกำหนดและข้อมูลอื่นๆที่ท่านให้อาจสามารถบ่งบอกความเป็นอัตลักษณ์ของ ท่านได้ และอาจถูกแสดงบนเว็บไซต์นี้โดยเจตนา " +
            @"(ขึ้นอยู่กับขั้นตอนการลงทะเบียนของท่าน หรือ การตั้งค่าบริการหรือการตั้งค่าบนเว็บไซต์ต่างๆ) หรือมิได้เจตนา (เป็นผลจากการละเมิดโดยบุคคลที่สาม)";

        public static string lbContent2Detail3 =
            @"ทั้งนี้การเยี่ยมชมเว็บไซต์ของท่าน อาจมีผลให้ได้รับโปรแกรม cookies ซึ่งรวบรวมข้อมูลการเข้าเยี่ยมชมเว็บไซต์ต่างๆของท่าน โดยจดจำการตั้งค่าส่วนตัว หรือ " +
            @"ใช้ข้อมูลที่ไม่เป็นส่วนตัวที่สามารถบ่งบอกความเป็นตัวตนได้ หรือรหัสนิรนามเพื่อทำการวิเคราะห์เกี่ยวกับการเยี่ยมชมและรูปแบบการใช้งาน  โปรแกรม cookies " +
            @"คือส่วนเล็กๆของข้อมูลที่ฝังตัวอยู่ในเว็บเบราว์เซอร์ ในคอมพิวเตอร์ของผู้ใช้งาน ที่สามารถถูกกู้กลับคืนได้ โดยเว็บไซต์นั้น หากท่านไม่ต้องการโปรแกรม cookies เหล่านี้ " +
            @"ท่านสามารถเปลี่ยนการตั้งค่าบนเบราว์เซอร์ของท่านได้ อย่างไรก็ดี ท่านจะไม่สามารถเข้าสู่เนื้อหาบางส่วนของเว็บไซต์นี้ได้";

        public static string lbContent3 = @"3. การใช้ข้อมูล";

        public static string lbContent3Detail1 =
            @"ข้อมูล ที่ธนาคารรวบรวมจากท่านจะถูกนำไปใช้เพื่อวัตถุประสงค์ในการดำเนินงานของ ธนาคาร รวมถึงการจัดเตรียมผลิตภัณฑ์และบริการที่ท่านแจ้งความประสงค์ " +
            @"อย่างไรก็ดี ข้อมูลของท่านอาจถูกใช้เพื่อวัตถุประสงค์อื่นๆ เช่น เพื่อเป็นการบังคับใช้ หรือปกป้องสิทธิของธนาคารให้เป็นไปตามกฎหมายที่บังคับใช้ ข้อบังคับ และกฎเกณฑ์ทั้งหมด " +
            @"เพื่อปรับปรุงคุณภาพของผลิตภัณฑ์และบริการต่างๆของธนาคาร เพื่อป้องกันการฉ้อโกง หรือกิจกรรมผิดกฎหมาย หรือเพื่อจัดเตรียมข้อมูลเกี่ยวกับการใช้ผลิตภัณฑ์และบริการต่างๆของธนาคาร " +
            @"รวมทั้งการนำเสนอผลิตภัณฑ์และบริการใหม่ที่ธนาคารเชื่อว่าจะเป็นประโยชน์แก่ ท่านเพิ่มเติมตามดุลยพินิจของธนาคาร ซึ่งอาจให้กับบุคคลที่สาม   นักโฆษณา บริษัทในเครือ บุคคลที่สามที่เกี่ยวข้องในการรวบรวมข้อมูลเชิงสถิติ";

        public static string lbContent4 = @"4. การเข้าถึงข้อมูลของพนักงาน";

        public static string lbContent4Detail1 =
            @"ธนาคาร ตระหนักถึงความมุ่งมั่นในการให้ความเคารพ รักษาความปลอดภัย ปกป้องและรักษาข้อมูลส่วนตัวของท่าน " +
            @"โดยมั่นใจว่าการเข้าถึงของพนักงานต่อข้อมูลที่ได้มีการเปิดเผย แบ่งปัน แลกเปลี่ยน หรือ ได้มอบให้แก่ธนาคารนั้น จะถูกจำกัดเฉพาะพนักงานที่ได้รับอนุญาต " +
            @"ซึ่งเป็นผู้ที่ได้รับการอบรมโดยสมบูรณ์ และเพียบพร้อมด้วยความสามารถในด้านการจัดการข้อมูลเป็นอย่างดี ทั้งนี้ พนักงานแต่ละท่านที่ได้รับอนุญาตดังกล่าว ต้องปฏิบัติตามคำมั่นสัญญาข้างต้น " +
            @"โดยเฉพาะอย่างยิ่งในเรื่องการอุทิศตนเพื่อคุ้มกันความเป็นส่วนตัวของข้อมูล ของท่านตลอดเวลา หากพนักงานที่ได้รับอนุญาตไม่ปฏิบัติตามข้อบังคับ และข้อตกลงโดยทั่วไปของนโยบายความเป็นส่วนตัวนี้ จะมีการลงโทษทางวินัย";

        public static string lbContent5 = @"5. มาตรการที่ใช้ป้องกันความเป็นส่วนตัวของข้อมูล";

        public static string lbContent5Detail1 =
            @"ธนาคารมีนโยบายเพื่อให้มั่นใจได้ว่า มาตรการและระเบียบการต่างๆได้ใช้เพื่อป้องกันความเป็นส่วนตัวของข้อมูลของ ท่านมีการควบคุมอย่างเข้มงวดและเพียงพอ " +
            @"ซึ่งทั้งหมดที่กล่าวนี้จะถูกใช้อย่างต่อเนื่องแม้ว่าสัญญาใดๆระหว่างธนาคาร กับท่านได้สิ้นสุดลงแล้วก็ตาม ในขณะที่ธนาคารได้ใช้ความพยายามอย่างเต็มกำลังเพื่อให้มั่นใจว่าความเป็น " +
            @"ส่วนตัวของข้อมูลได้ถูกรักษาไว้อย่างปลอดภัย ขอให้ท่านตระหนักถึงความเป็นจริงแล้ว ไม่มีการส่งข้อมูลใดๆทางอินเตอร์เน็ตและ / หรือ ทางช่องทางอิเล็คทรอนิคส์ อื่นๆ ที่สามารถรับประกันได้ว่าจะปลอดภัยโดยสมบูรณ์ทั้งหมด";

        public static string lbContent5Detail2 =
            @"นอกจากนี้ ธนาคารจะไม่รับผิดชอบต่อท่านหรือต่อบุคคลใดๆ ในความเสียหายหรือความสูญเสียใดๆ (รวมถึงความเสียหายใดๆ ไม่ว่าทางตรง ทางอ้อม ความเสียหายพิเศษ หรือที่ตามมา " +
            @"ความเสียหายทางเศรษฐกิจ การสูญเสียกำไร หรือการสูญเสียโอกาส) ซึ่งเป็นผลมาจากการที่ข้อมูลดังกล่าวได้ถูกโจรกรรม ถูกทำให้เสียหาย ถูกคัดลอก ถูกใช้ในทางที่ผิด หรือใช้ผิดวิธี หรือถูกทำให้ไม่ปลอดภัย " +
            @"ยกเว้นการล่มของระบบซึ่งเกิดจากการกระทำโดยตรงของธนาคาร หรือการประมาทเลินเล่ออย่างร้ายแรง หรือการละทิ้ง หรือการทุจริต หรือเมื่อการล่มของระบบดังกล่าวเกิดจากธนาคารละเมิดกฎหมายใดที่มีผลบังคับ " +
            @"ใช้กับธนาคาร หรือเมื่อธนาคารได้รับแจ้งให้ทราบถึงโอกาสที่จะเกิดการล่ม หรือเกิดจากความล่าช้า หรือความผิดพลาดในการส่งต่อหรือการสื่อสารที่เกี่ยวข้องกับข้อมูลดังกล่าว";

        public static string lbContent6 = @"6. การแบ่งปันข้อมูล";

        public static string lbContent6Detail1 =
            @"ธนาคารจะทำการเปิดเผยข้อมูลของท่านแก่บุคคล ที่สาม หรือบุคคลภายนอกองค์กรใดๆ หากได้รับการยินยอมจากท่านให้ทำการเปิดเผยข้อมูลดังกล่าวได้ เพื่อให้ธนาคารสามารถให้บริการแก่ท่านได้ดียิ่งขึ้น และให้ท่านได้รับทราบข่าวสารเกี่ยวกับข้อเสนอทางการตลาดและการส่งเสริมการ ขาย ที่ธนาคารเห็นว่าเป็นประโยชน์ และมีผลดีแก่ท่าน ชื่อของท่าน การติดต่อโดยเฉพาะเจาะจง  และ/หรือ ข้อมูลที่ไม่ใช่ข้อมูลทางการเงิน อาจถูกมอบเป็นระยะๆให้กับ (i) บริษัทใดๆภายในกลุ่มซีไอเอ็มบี ที่ตั้งอยู่ ดำเนินธุรกิจ ถูกรวมหรือก่อตั้งภายในประเทศไทย และ (ii) บุคคลที่สามอื่นใด (รวมถึง บริษัทในเครือของกลุ่มซีไอเอ็มบี บุคคลที่สามที่ทำความตกลงทางการตลาดร่วม และ/หรือร่วมโฆษณาส่งเสริมการขายกับบุคคลภายนอก) ภายในหรือภายนอกประเทศไทย และบริษัทใดๆ ภายในกลุ่มซีไอเอ็มบี ที่ตั้งอยู่ ดำเนินธุรกิจ ถูกรวม หรือ ถูกก่อตั้ง ภายนอกประเทศไทย เมื่อได้รับความเห็นชอบจากท่าน";

        public static string lbContent6Detail2 =
            @"การนำข้อมูลดังกล่าวไปยังบริษัทใดๆภายในกลุ่มซีไอเอ็มบี และ/หรือบุคคลที่สาม จะต้องได้รับความยินยอมจากท่านในการเปิดเผยข้อมูลดังกล่าว ธนาคารตระหนักและมั่นใจว่าบุคคลที่สามดังกล่าวปฏิบัติตามมาตรฐานเดียวธนาคาร ที่ใช้การควบคุมความเป็นส่วนตัวของข้อมูลของท่านเสมือนว่าธนาคารเป็นผู้ ดำเนินการเอง หากท่านไม่ประสงค์ที่จะให้ชื่อของท่าน ข้อมูลการติดต่อ และ/หรือข้อมูลที่ไม่ใช่ข้อมูลทางการเงินเปิดเผยต่อบริษัทใดๆภายในกลุ่มซีไอ เอ็มบีหรือต่อบุคคลที่สามดังกล่าว เพื่อวัตถุประสงค์ในการแนะนำ และ/หรือ ท่านไม่ประสงค์ที่จะได้รับการติดต่อจากธนาคาร หรือ บุคคลที่สามดังกล่าวในเรื่องการขายหรือการส่งเสริมการขายของผลิตภัณฑ์และ บริการใดๆ ที่มีการประกาศข้อมูลผ่านการส่งเสริมการขาย และ/หรือการตลาด ทั้งนี้ขอให้ท่านแจ้งต่อธนาคารทางอีเมล์ หรือ ทางศูนย์บริการทางโทรศัพท์ของธนาคาร ตามที่อยู่ อีเมล์ หรือเบอร์โทรศัพท์ที่ระบุในข้อ 10 ด้านล่างนี้) ทั้งนี้ โปรดรอประมาณ 1-2 สัปดาห์ เพื่อให้คำร้องแจ้งประสงค์ของท่านมีผลใช้บังคับ ผ่านช่องทางการสื่อสารใดๆที่ท่านเลือกในการแจ้งความประสงค์ของท่านแก่ธนาคาร โปรดทำการระบุชื่อของท่านตามหมายเลขบัตรประจำตัวประชาชนหรือหมายเลขหนังสือ เดินทาง และหากท่านตัดสินใจภายหลังในการขอรับข้อมูลส่งเสริมการขาย และ/หรือการตลาด ท่านสามารถแจ้งพนักงานของธนาคารที่ศูนย์บริการทางโทรศัพท์ได้ ธนาคารมีความยินดีที่จะให้การช่วยเหลือแก่ท่านตามที่ท่านประสงค์";

        public static string lbContent6Detail3 =
            @"แม้ว่าจะเป็นไปตามหลักเกณฑ์โดยทั่วไปของนโยบายความเป็นส่วนตัว และ ในขณะที่ธนาคารพยายามป้องกันความเป็นส่วนตัวของข้อมูลของท่านตลอดเวลา ธนาคารอาจมีการเปิดเผยข้อมูลของท่านแก่บุคคลที่สาม หากการเปิดเผยนั้น";

        public static string lbContent6Detail31 = @"1. มีการร้องขอ หรือ ได้รับมอบอำนาจจากท่าน";

        public static string lbContent6Detail32 =
            @"2. มีการนำไปใช้เพื่อให้เกิดความสมบูรณ์ ความถูกต้อง หรือ ใช้จำกัดธุรกรรมใดๆที่กระทำโดยท่าน";

        public static string lbContent6Detail33 =
            @"3. เพื่อให้ข้อมูลแก่บริษัท ข้อมูลเครดิตแห่งชาติ จำกัด เมื่อมีการร้องขอ";

        public static string lbContent6Detail34 =
            @"4. เมื่อเป็นการกระทำที่ชอบด้วยกฎหมาย หรือ เป็นการกระทำที่กฎหมายกำหนด ";

        public static string lbContent6Detail35 = @"5. เมื่อเป็นการปฏิบัติตามคำสั่งศาล หรือข้อกำหนดทางกฎหมาย";
        public static string lbContent6Detail36 = @"6. เพื่อเป็นการปกป้องและคุ้มครองสิทธิและทรัพย์สินของธนาคาร";
        public static string lbContent6Detail37 = @"7. เพื่อเป็นการปกป้องผลประโยชน์ของสาธารณะ";

        public static string lbContent6Detail4 =
            @"ซึ่งรวมถึงแต่ไม่จำกัดในเรื่องการตรวจหาอาชญากรรม และการจับกุมผู้กระทำผิดกฎหมาย";

        public static string lbContent7 = @"7. ทางเลือกในการให้ข้อมูลของลูกค้า";

        public static string lbContent7Detail1 =
            @"ในขณะที่ท่านไม่มีข้อผูกมัดหรือพันธะใดๆใน การให้ข้อมูลของท่านแก่ธนาคาร การเลือกของท่านในการกระทำดังกล่าว (ไม่ว่าจะเกิดจากการไม่เห็นด้วยกับวิธีการป้องกันความเป็นส่วนตัวของข้อมูล ที่ธนาคารใช้ หรือกรณีอื่นใดก็ตาม) อาจส่งผลให้ท่านไม่สามารถเข้าถึง หรือใช้งานผลิตภัณฑ์และบริการของธนาคารได้อย่างเต็มที่ ซึ่งทั้งนี้จะไม่ถือเป็นหน้าที่และความผิดชอบของธนาคาร";

        public static string lbContent8 = @"8. ความถูกต้องของข้อมูล";

        public static string lbContent8Detail1 =
            @"ธนาคารตระหนักถึงข้อมูลพื้นฐานที่ถูกต้อง เพื่อนำเสนอผลิตภัณฑ์และบริการให้ตรงกับความต้องการของลูกค้านั้น ด้วยข้อมูลของลูกค้าที่เปิดเผย แบ่งปัน แลกเปลี่ยน ให้ถูกต้องและสมบูรณ์เสมอ  โดยการแจ้งเปลี่ยนแปลงข้อมูลที่เป็นปัจจุบัน ต่อธนาคารด้วยการเขียน หรือ โดยวิธีการอื่นที่ธนาคารยอมรับการเปลี่ยนแปลงใดๆในข้อมูลนั้น";

        public static string lbContent9 = @"9. การเชื่อมโยงกับเว็บไซต์ต่างๆ";

        public static string lbContent9Detail1 =
            @"เว็บไซต์ ของธนาคาร อาจมีไฮเปอร์ลิงค์ ที่เชื่อมต่อกับเว็บไซต์อื่นๆ ที่ธนาคารมิได้เป็นผู้ดำเนินการ ซึ่งการเชื่อมต่อยังเว็บไซต์เหล่านั้น ไม่รับรองเป็นทางการหรือดำเนินการแทนเว็บไซต์บุคคลเหล่านั้น ข้อมูลส่วนบุคคลที่ท่านเลือกให้กับบุคคลภายนอกไม่อยู่ภายใต้ นโยบายความเป็นส่วนของธนาคาร ดังนั้น ธนาคารจะไม่รับประกันเกี่ยวกับข้อมูลที่มีในเว็บไซต์ดังกล่าว และธนาคารจะไม่รับผิดชอบต่อเนื้อหา หรือวิธีปฏิบัติที่เกี่ยวข้องกับความเป็นส่วนตัวใดๆของเว็บไซต์นั้นๆ";

        public static string lbContent10 = @"10. สอบถามเกี่ยวกับนโยบายความเป็นส่วนตัว และการจัดการข้อร้องเรียน";

        public static string lbContent10Detail1 =
            @"หากท่านมีข้อสงสัยเกี่ยวกับนโยบายความเป็นส่วนตัวนี้ หรือมีข้อร้องเรียนที่เกี่ยวข้องกับเรื่องใดๆ โปรดติดต่อศูนย์บริการธนาคาร ซีไอเอ็มบี ไทย หรืออีเมล์ตามที่ระบุไว้ด้านล่าง";

        public static string lbContent10Detail11 = @"CIMB Thai Care Center";
        public static string lbContent10Detail12 = @"44 ถนนหลังสวน แขวงลุมพินี เขตปทุมวัน กรุงเทพมหานคร 10330";
        public static string lbContent10Detail13 = @"โทรศัพท์: 0-2626-7777";
        public static string lbContent10Detail14 = @"โทรสาร: 0-2626-7770";
        public static string lbContent10Detail15 = @"อีเมล์: cimbthai.carecenter@cimbthai.com";
        #endregion
    }
}