using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace WebHelper.ServiceLayer
{
    public static class TermOfUseService
    {
        #region TermOfUse
        public static string lbTfuContentH = @"ข้อตกลงการใช้บริการ";
        public static string lbTfuContent1 = @"ข้อตกลงและเงื่อนไขของการบริการ";

        public static string lbContentDetail1 =
            @"ผู้ใช้บริการขอรับรองว่า ข้อมูลและรายละเอียดต่าง ๆ ที่ให้ไว้ในใบคำขอสมัครใช้บริการ CIMB Thai Biz-Channel ถูกต้องและเป็นความจริงทุกประการ";

        public static string lbContentDetail2 =
            @"ผู้ใช้บริการยอมรับที่จะใช้บริการ CIMB Thai Biz-Channel โดยต้องปฏิบัติตามข้อตกลงและเงื่อนไขการใช้บริการตามที่ธนาคารกำหนด และผู้ใช้บริการยอมรับที่จะผูกพันตนตามข้อตกลงและเงื่อนไขในการใช้บริการที่ ปรากฏในใบคำขอสมัครใช้บริการนี้ตลอดจนข้อตกลงและเงื่อนไขอื่นๆที่ได้ลงนามใน การใช้ผลิตภัณฑ์และ/หรือบริการและวิธีการที่เกี่ยวข้องกับการบริการ CIMB Thai Biz-Channel ตามที่ธนาคารกำหนด";

        public static string lbContentDetail3 =
            @"ธนาคารสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขและข้อตกลงต่าง ๆ ตลอดจนอัตราค่าธรรมเนียมในการให้บริการได้ โดยหากธนาคารจะเปลี่ยนแปลงเงื่อนไขและข้อตกลงใด ๆ ที่เกี่ยวข้องกับการใช้บริการของธนาคาร รวมถึงอัตราค่าธรรมเนียมการให้บริการ ธนาคารจะประกาศหรือแจ้งให้ผู้ใช้บริการทราบล่วงหน้าเป็นระยะเวลา ไม่น้อยกว่า 30 วัน ทั้งนี้ เมื่อผู้ใช้บริการใช้บริการ CIMB Thai Biz-Channel ต่อไป หลังจากวันที่การเปลี่ยนแปลงดังกล่าวมีผลใช้บังคับ ถือว่าผู้ใช้บริการได้ยอมรับเงื่อนไขและข้อตกลงนั้น ๆ ตลอดจนอัตราค่าธรรมเนียมที่เปลี่ยนแปลงนั้นแล้ว";

        public static string lbContentDetail4 =
            @"ธนาคารมีสิทธิที่จะแก้ไขเปลี่ยนแปลง ประเภทหรือแบบหรือรายการเฉพาะของอุปกรณ์ หรือเครื่องมือคอมพิวเตอร์ ซึ่งผู้ใช้บริการจำเป็นต้องใช้ในการเชื่อมต่อกับ CIMB Thai Biz-Channel หรือขอให้ผู้ใช้บริการยกระดับโปรแกรมซอฟท์แวร์หรือโปรแกรมการค้นหาข้อมูลทาง เครือข่ายได้ ในกรณีที่ผู้ใช้บริการไม่ดำเนินการดังกล่าวตามที่ธนาคารร้องขอ ธนาคารสามารถปฏิเสธที่จะดำเนินการตามคำสั่งของผู้ใช้บริการและบอกเลิกสัญญา นี้ได้";

        public static string lbContentDetail5 =
            @"ผู้ใช้บริการรับทราบว่า การให้บริการ CIMB Thai Biz-Channel เป็นช่องทางหนึ่งในการให้ความสะดวกแก่ผู้ใช้บริการ ดังนั้น ผู้ใช้บริการยอมรับว่า ธนาคารอาจใช้ข้อมูลของผู้ใช้บริการที่ได้ให้ไว้แก่ธนาคารในการระบุตัวและ ตรวจสอบความถูกต้องของผู้ใช้บริการตามที่เห็นสมควรเพื่อให้บริการแก่ผู้ใช้ บริการในบางธุรกรรมตามที่ธนาคารเห็นสมควร เช่น การสอบถามยอด การระงับการให้บริการ เป็นต้น";

        public static string lbContentDetail6 =
            @"ผู้ใช้บริการรับทราบว่าการให้บริการ CIMB Thai Biz-Channel เป็นช่องทางหนึ่งในการให้ความสะดวกแก่ผู้ใช้บริการ ดังนั้น ผู้ใช้บริการตกลงยอมรับในความเสียหายใดๆ ที่เกิดจากความผิดพลาดหรือข้อบกพร่องของระบบอินเตอร์เน็ต ระบบสื่อสารคอมพิวเตอร์ หรือ อิเล็กทรอนิกส์ อุปกรณ์ต่างๆ หรือจากการกระทำของผู้ใช้บริการเอง หรือจากการกระทำของบุคคลอื่น ไม่ว่าจะโดยทุจริตหรือไม่ก็ตาม โดยการใช้บริการนั้นมีการใช้เลขประจำตัวลูกค้า และ รหัสลับส่วนตัวของผู้ใช้บริการประกอบกับวิธีการหรือเงื่อนไขการให้บริการ ประเภทนั้น ๆ ตามที่ธนาคารกำหนด";

        public static string lbContentDetail7 =
            @"ผู้ใช้บริการยอมรับว่าหลักฐานของเอกสารใด ๆ ก็ตามที่ผู้ใช้บริการและหรือธนาคารได้จัดทำขึ้นอันเนื่องมาจากการใช้บริการ CIMB Thai Biz-Channel ของผู้ใช้บริการตามใบคำขอนี้ ไม่ว่าจะเป็นเอกสารที่ผู้ใช้บริการได้ลงนามและส่งมอบให้ธนาคารโดยตรง หรือเป็นเอกสารที่ผู้ใช้บริการได้ทำผ่านระบบอินเตอร์เน็ต หรือเอกสารใดๆก็ตามที่เป็นหลักฐานซึ่งแสดงการถึงการใช้บริการ CIMB Thai Biz-Channel ของผู้ใช้บริการ ให้ถือเป็นเอกสารที่มีความถูกต้องสมบูรณ์ทุกประการโดยไม่จำเป็นต้องให้ผู้ ใช้บริการลงลายมือชื่อหรือตรวจสอบก่อนแต่อย่างใด และธนาคารสามารถใช้บันทึกหรือเอกสารเหล่านี้เป็นพยานหลักฐานในกรณีต่าง ๆ ได้ทั้งสิ้น";

        public static string lbContentDetail8 =
            @"ผู้ใช้บริการรับทราบว่า การใช้บริการใด ๆ ต้องให้ระยะเวลาอันสมควรแก่ธนาคารในการดำเนินการตามขั้นตอนที่จำเป็นเพื่อ ให้บริการ โดยผู้ใช้บริการจะไม่เรียกร้องให้ธนาคารต้องรับผิดชอบต่อความเสียหาย ใด ๆ ที่เกิดจากความล่าช้าในขั้นตอนของการดำเนินการ";

        public static string lbContentDetail9 =
            @"ผู้ใช้บริการรับทราบและตกลงว่าผู้ใช้บริการจะไม่ใช้ธุรกรรมบนระบบบริการ CIMB Thai Biz-Channel ไปในทางที่ผิดกฎหมาย หรือในลักษณะที่อาจก่อให้เกิดความเสียหายจนไม่สามารถใช้การได้ หรือก่อให้เกิดภาระหรือลดคุณค่าของการบริการ หรือรบกวนการใช้หรือสิทธิของบุคคลอื่น นอกจากนี้ผู้ใช้บริการจะต้องไม่พยายามที่จะทำให้ได้มาซึ่งการเข้าสู่ข้อมูล ที่ไม่ได้รับอนุญาตที่มีต่อรายการทางบัญชี ระบบคอมพิวเตอร์ หรือเครือข่ายที่ใช้ร่วมกับการบริการ CIMB Thai Biz-Channel หรือรบกวนหรือก่อให้เกิดความสับสนต่อรายการทางบัญชี ระบบคอมพิวเตอร์ หรือเครือข่ายที่เชื่อมต่อกับการบริการ CIMB Thai Biz-Channel หรือพยายามให้ได้มาซึ่งอุปกรณ์หรือข้อมูลใดๆไม่ว่าวิธีใดก็ตามซึ่งมิได้มี อยู่หรือจัดหาให้โดยความตั้งใจของธนาคารผ่านการบริการ CIMB Thai Biz-Channel และจะไม่ใช้และทำธุรกรรม CIMB Thai Biz-Channel เพื่อที่จะได้มาซึ่งข้อมูลที่ไม่จำเป็นเพื่อออกแบบ พัฒนา หรือยกระดับโปรแกรมซอฟแวร์คอมพิวเตอร์ซึ่งไม่ได้รับอนุญาตโดยผู้ใช้บริการ ได้ใช้หรือจัดหาให้แก่บุคคลอื่นเพื่อใช้และทำธุรกรรม CIMB Thai Biz-Channel";

        public static string lbTfuContent2 = @"ข้อจำกัดความรับผิดของธนาคาร";

        public static string lbTfuContent21 =
            @"ในกรณีที่มีเหตุสุดวิสัย หรือเหตุอื่นใดที่อยู่นอกเหนือความคาดหมายหรือการควบคุมของธนาคาร เป็นเหตุให้การใช้บริการหรือการให้บริการตามข้อกำหนดและเงื่อนไขของคำขอ สมัครใช้บริการนี้เกิดขัดข้องหรือเกิดอุปสรรคต่อการใช้งาน หรือข้อมูลผิดพลาด หรือไม่สามารถใช้บริการหรือให้บริการได้ เช่น ระบบคอมพิวเตอร์ของธนาคารและหรือระบบสื่อสารขัดข้องหรือไม่สามารถใช้งานได้ ชั่วคราวเพราะกระแสไฟฟ้าขัดข้อง หรือปัญหาทางด้านพลังงาน ภัยพิบัติทางธรรมชาติ การกระทำของบุคคล การกระทำหรือนโยบายของหน่วยงานรัฐ อัคคีภัย การประท้วง การนัดหยุดงาน การจลาจล สงคราม ไวรัสคอมพิวเตอร์ การขัดข้องของระบบงาน หรือการส่งสัญญาณเชื่อมต่อไม่ทำงานหรือล้มเหลว หรือเหตุอื่นๆใดในทำนองเดียวกันนี้ ผู้ใช้บริการตกลงจะไม่ยกเอาเหตุดังกล่าวเป็นข้อเรียกร้องให้ธนาคารรับผิดใดๆ ทั้งสิ้น";

        public static string lbTfuContent3 = @"การเปิดเผยข้อมูล";

        public static string lbTfuContent31 =
            @"ผู้ใช้บริการตกลงยินยอมให้ธนาคารเปิดเผยข้อมูลของผู้ใช้บริการที่ได้ระบุ ไว้ในใบคำขอใช้บริการ หรือข้อมูลที่เกี่ยวข้องในการใช้บริการ CIMB Thai Biz-Channel แก่ CIMB Bank Berhad ซึ่งเป็นบริษัทแม่ของธนาคาร, บริษัทในเครือของธนาคาร และหรือบุคคลอื่นใด ได้ตามความจำเป็นและเหมาะสม โดยไม่จำเป็นต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้าและผู้ใช้บริการตกลงและยอม รับว่าความยินยอมดังกล่าวยังมีผลอยู่ตลอดไปถึงแม้ว่าจะมีการยกเลิกการบริการ CIMB Thai Biz-Channel แล้วก็ตาม";

        public static string lbTfuContent4 = @"การเพิ่มบริการใหม่ หรือเพิ่มเติม/เปลี่ยนแปลงขอบเขตการให้บริการ";

        public static string lbTfuContent41 =
            @"ผู้ใช้บริการตกลงว่าธนาคารอาจจะให้บริการใหม่ หรือเพิ่มเติม/เปลี่ยนแปลงขอบเขตการให้บริการได้ โดยธนาคารจะแจ้งผู้ใช้บริการผ่านเครือข่ายอินเตอร์เน็ต หรือ โดยปิดประกาศแจ้งในที่เปิดเผย ณ ที่ทำการของธนาคาร ทั้งนี้ ในกรณีที่ผู้ใช้บริการได้ใช้บริการที่ธนาคารจัดให้ใหม่ หรือเพิ่มเติม/เปลี่ยนแปลงขอบเขตแล้ว ให้ถือว่าผู้ใช้บริการได้ตกลงยอมรับเงื่อนไขและข้อตกลงที่มีผลใช้บังคับแก่ บริการที่ธนาคารได้ให้ใหม่หรือเพิ่มเติม/เปลี่ยนแปลงขอบเขตนั้นแล้วโดยไม่มี ข้อโต้แย้ง";

        public static string lbTfuContent5 = @"การชดใช้ค่าเสียหาย";

        public static string lbTfuContent51 =
            @"ผู้ใช้บริการตกลงที่จะชดใช้ค่าเสียหายแก่ธนาคารเต็มจำนวนและตามความเป็น จริง สำหรับความสูญเสีย ความเสียหาย ความรับผิด หรือค่าใช้จ่ายใดๆ ทั้งหมดที่เกิดขึ้นอันส่งผลกระทบต่อธนาคารไม่ว่าโดยตรงหรือโดยอ้อม จากการปฏิบัติผิดหน้าที่หรือความประมาทเลินเล่อของผู้ใช้บริการตามข้อตกลง และเงื่อนไขนี้ หรือ เกิดขึ้นจากหรือเกี่ยวข้องกับการใช้บริการ CIMB Thai Biz-Channel และความรับผิดของผู้ใช้บริการดังกล่าวนี้ ให้ถือเป็นความรับผิดที่มีอยู่ต่อเนื่องตลอดไปถึงแม้ว่าจะมีการยกเลิกหรือ บอกเลิกบริการ CIMB Thai Biz-Channel แล้วก็ตาม";

        public static string lbTfuContent6 = @"การยกเลิกการให้บริการ";

        public static string lbTfuContent61 =
            @"ผู้ใช้บริการรับทราบว่า ธนาคารสงวนสิทธิ์ในการยกเลิกการให้บริการ CIMB Thai Biz-Channel นี้ทั้งหมดหรือเฉพาะบริการใดบริการหนึ่ง ที่ธนาคารให้บริการผ่านบริการ CIMB Thai Biz-Channel เมื่อใดก็ได้โดยไม่จำเป็นต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า";

        public static string lbTfuContent62 =
            @"ในกรณีที่ผู้ใช้บริการกระทำผิดโดยนำไปใช้ในทางที่ผิดกฎหมายหรือในลักษณะที่ อาจก่อให้เกิดความเสียหายจนไม่สามารถใช้การได้ หรือก่อให้เกิดภาระหรือลดคุณค่าของการบริการ หรือรบกวนการใช้หรือสิทธิของบุคคล ธนาคารมีสิทธิที่จะยกเลิกการบริการ CIMB Thai Biz-Channel ได้ทันที โดยมิต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า";

        public static string lbTfuContent63 =
            @"ในกรณีที่ธนาคารไม่สามารถหักเงินค่าธรรมเนียมรายปี หรือค่าธรรมเนียมการใช้บริการจากบัญชีหลักหรือจากบัญชีที่ผู้ใช้บริการแจ้ง ไว้กับธนาคารได้ ไม่ว่าด้วยเหตุใด ๆ ก็ตาม หลังจากที่ได้พยายามหักเงินดังกล่าวจากบัญชีข้างต้นเป็นจำนวน 3 ครั้งติดต่อกัน ธนาคารมีสิทธิยกเลิกการให้บริการ CIMB Thai Biz-Channel โดยแจ้งให้ผู้ใช้บริการทราบล่วงหน้าอย่างน้อยเป็นระยะเวลา 30 วัน";

        public static string lbTfuContent64 =
            @"ในกรณีที่ผู้ใช้บริการปฏิบัติผิดสัญญาข้อใดข้อหนึ่ง ธนาคารมีสิทธิที่จะยกเลิกสัญญาการบริการ CIMB Thai Biz-Channel โดยแจ้งให้ผู้ใช้บริการทราบล่วงหน้าอย่างน้อยเป็นระยะเวลา 30 วัน";

        public static string lbTfuContent65 =
            @"ผู้ใช้บริการมีสิทธิที่ยกเลิกการบริการ CIMB Thai Biz-Channel ทั้งหมด หรือ เฉพาะบริการใดบริการหนึ่งโดยแจ้งให้ธนาคารทราบล่วงหน้าอย่างน้อยเป็นระยะ เวลา 30 วัน";

        public static string lbTfuContent66 =
            @"ผู้ใช้บริการตกลงให้ข้อตกลงและเงื่อนไขการใช้บริการ CIMB Thai Biz-Channel นี้มีผลใช้บังคับแก่ผู้ใช้บริการตลอดไป จนกว่าธนาคารจะยกเลิกการให้บริการ หรือ จนกว่าผู้ใช้บริการจะขอยกเลิกการใช้บริการด้วยตนเอง โดยจัดทำคำขอยกเลิกการใช้บริการกับธนาคารเป็นลายลักษณ์อักษร ตามวิธีที่ธนาคารกำหนด ทั้งนี้ เพื่อป้องกันมิให้เกิดความเสียหายแก่ผู้ใช้บริการจากการยกเลิกใช้บริการ CIMB Thai Biz-Channel ผู้ใช้บริการจะต้องยกเลิกรายการค้างที่ได้มีคำสั่งทำรายการล่วงหน้าไว้ใน บริการ CIMB Thai Biz-Channel ให้หมดก่อนที่จะทำการยกเลิกดังกล่าวได้ โดยธนาคารจะดำเนินการยกเลิกให้เสร็จสิ้นภายใน 3 วันทำการ นับจากวันที่ได้รับคำขอเปลี่ยนแปลง/ยกเลิกข้อมูลบริการ";

        public static string lbTfuContent67 =
            @"การยกเลิกการให้บริการ จะไม่มีผลกระทบต่อสิทธิของธนาคารที่จะเรียกร้องให้ผู้ขอใช้บริการปฏิบัติหน้าที่ที่มีอยู่กับธนาคารจนครบถ้วน";

        public static string lbTfuContent7 = @"กฎหมายที่ใช้บังคับ";

        public static string lbTfuContent71 =
            @"เงื่อนไขและข้อกำหนดการใช้เว็บไซต์เหล่านี้จะ อยู่ภายใต้บังคับของกฎหมาย แห่งราชอาณาจักรไทย และข้อพิพาทใดๆที่เกี่ยวข้องจะอยู่ภายใต้อำนาจในการ ตัดสินคดีของศาลไทย ผู้ใช้บริการตกลงว่าความสัมพันธ์ที่มีอยู่ระหว่างผู้ใช้บริการกับธนาคารอัน เป็นผลมาจากการทำข้อตกลงนี้หรือการใช้บริการ CIMB Thai Biz-Channel นี้ ไม่เป็นกิจการร่วมค้า หุ้นส่วน การว่าจ้างหรือกิจการตัวแทนระหว่างผู้ใช้บริการกับธนาคารแต่อย่างใดทั้งสิ้น";
        #endregion

    }
}